CPParthasarathy/SQD/sdkconfig.defaults
# B3.1 common platform configuration.
# Controlled hardware invariants shared by all build profiles.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
# B3.3 reproducible-build controls.
CONFIG_APP_REPRODUCIBLE_BUILD=y
# CONFIG_APP_COMPILE_TIME_DATE is not set
# CONFIG_BOOTLOADER_COMPILE_TIME_DATE is not set
